import type { Context } from "grammy";

export async function handleHelp(ctx: Context): Promise<void> {
  ctx.reply(
    `<b>يمكن لـ<b>bookie</b> تحميل الكتب بصيغة PDF من أكبر منصة كتب عربية مفتوحة المصدر؛ مكتبة نور</b>.\n\nنعمل أيضاً على إضافة عدة مصادر أخرى قريباً، وتوفير مخزن كتب إلكتروني مجاني للوصول إلى أكبر عدد كتب ممكن وبأسرع وقت.\n\nلتحميل الكتب من مكتبة نور، أرسل رابط الكتاب مباشرةً، أو إبحث عن الكتاب عبر:\n1. كتابة الأمر /search\n2. ثم كتابة إسم الكتاب\n3. ثم إختيار أي كتاب بعد إرسال الرسالة عبر الأمر الخاص بكل كتاب ذي البادئة dl_\n\nيتخطى bookie تلقائياً مطالبات مكتبة نور بتسجيل حساب، كما يتخطى أيضاً المؤقتات التي تتطلب إشتراكاً شهرياً لإزالتها.\n\nللتحقق من الصفة القانونية لـ bookie:\n/legal`,
    {
      parse_mode: "HTML",
    },
  );
  return;
}
